Tekla Open API Reference for Tekla Structures 2025
BooleanPart.BooleanOperativeClassName Field
 A constant string that defines a part class name to be the boolean operative part. This class must be used when inserting the operative part to the database.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string BooleanOperativeClassName = "BlOpCl"
Public Const BooleanOperativeClassName As String = "BlOpCl"
Field Value
Type: String
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace